[
  {
    "type": "GENERIC",
    "id": "teddy_bear",
    "name": { "str": "plush toy" },
    "description": "A manufactured plush toy.  This is the default variant, if you see it something went wrong.",
    "category": "other",
    "material": [ "cotton" ],
    "weight": "900 g",
    "volume": "3 L",
    "price": 2000,
    "price_postapoc": 100,
    "symbol": "i",
    "color": "cyan",
    "flags": [ "SLEEP_AID", "NO_SALVAGE" ],
    "variant_type": "generic",
    "variants": [
      {
        "id": "toy_plush_teddy",
        "name": { "str": "teddy bear" },
        "description": "A mass-produced plush teddy bear.  It is wearing a little red t-shirt but no pants.",
        "weight": 1
      },
      {
        "id": "toy_plush_teddy_zombie",
        "name": { "str": "zombie teddy bear" },
        "description": "A dark green teddy bear with stylized stitches all over and X's for eyes.  The perfect size for a small child to hug the unlife out of.  Looks like the zombie apocalypse hit the toy store shelves first.",
        "weight": 1
      },
      {
        "id": "toy_plush_ferret",
        "name": { "str": "ferret plushie" },
        "description": "A large plush ferret with cute beady eyes.",
        "weight": 1
      },
      {
        "id": "toy_plush_trex",
        "name": { "str": "T-rex plushie" },
        "description": "A large plush t-rex.",
        "weight": 1
      },
      {
        "id": "toy_plush_penguin",
        "name": { "str": "penguin plushie" },
        "description": "A velvety-soft plush penguin.  It makes a funny noise when you hug it.",
        "weight": 1
      },
      {
        "id": "toy_plush_rabbit",
        "name": { "str": "rabbit plushie" },
        "description": "A large plush rabbit.",
        "weight": 1
      },
      {
        "id": "toy_plush_remora",
        "name": { "str": "remora plushie" },
        "description": "A large plush remora, a fish commonly seen alongside sharks.  Wait, wasn't there a shark plushie somewhere here…",
        "weight": 1
      },
      {
        "id": "toy_plush_fox",
        "name": { "str": "fox plushie" },
        "description": "A large plush fox.  It isn't realistic enough to trick a zombie into going after it, but it's very cute and makes a comforting bedtime companion.",
        "weight": 1
      }
    ]
  },
  {
    "type": "GENERIC",
    "id": "shark_plushie",
    "name": { "str": "shark plushie" },
    "description": "A somewhat large, mass produced shark plushie.  Meant to provide comfort to people of all ages.",
    "category": "other",
    "material": [ "cotton" ],
    "weight": "625 g",
    "volume": "30 L",
    "longest_side": "103 cm",
    "price": 600,
    "price_postapoc": 20,
    "symbol": "s",
    "color": "cyan",
    "flags": [ "SLEEP_AID" ]
  },
  {
    "type": "GENERIC",
    "id": "toy_figurine_large",
    "name": { "str": "large figurine" },
    "description": "A large manufactured figurine.  This is the default variant, if you see it something went wrong.",
    "category": "other",
    "material": [ "plastic" ],
    "weight": "500 g",
    "volume": "1 L",
    "price": 2000,
    "price_postapoc": 20,
    "symbol": "f",
    "color": "cyan",
    "variant_type": "generic",
    "variants": [
      {
        "id": "toy_figure_trex",
        "name": { "str": "T-rex figurine" },
        "description": "A relatively large plastic figurine of a T-rex.",
        "weight": 1
      },
      {
        "id": "toy_figure_tank",
        "name": { "str": "battle tank play-set" },
        "description": "Ready for deployment upon the playroom’s battle fields, with its main gun raised to the fore, this tank is resplendent with a truly excessive amount of high-caliber ordinance.  Its abandoned, grimly staring crew rests haphazardly within the turret: tiny soldiers forsaken by a commander who will never return and as lifeless as their full-sized compatriots.",
        "weight": 1
      },
      { "id": "toy_figure_xenomorph", "name": { "str": "alien statuette" }, "description": "", "weight": 1 }
    ]
  },
  {
    "type": "GENERIC",
    "id": "toy_figurine",
    "name": { "str": "figurine" },
    "description": "A normal-sized manufactured figurine.  This is the default variant, if you see it something went wrong.",
    "category": "other",
    "material": [ "plastic" ],
    "weight": "68 g",
    "volume": "36 ml",
    "longest_side": "10 cm",
    "//": "Numbers modelled in line with 1:18 scale figures.",
    "price": 2000,
    "price_postapoc": 10,
    "symbol": "f",
    "color": "cyan",
    "variant_type": "generic",
    "variants": [
      {
        "id": "toy_figure_swordsman",
        "name": { "str": "swordsman figurine" },
        "description": "A figurine of some unnamed swordsman, covered with scars and equipped with sturdy leather armor.  Seems to be ready to fight.",
        "weight": 1
      },
      {
        "id": "toy_figure_female",
        "name": { "str": "fashionable doll" },
        "description": "A plastic figurine of a young woman.  She's meant to be dressed up and accessorized with a wide variety of clothing, sold separately.",
        "weight": 1
      },
      {
        "id": "toy_figure_krueger",
        "name": { "str": "nightmare figurine" },
        "description": "A plastic figurine with a nightmarish, scarred face.  He wears a hat and has three long blades extending from a glove on the back of his hand.",
        "weight": 1
      },
      {
        "id": "toy_figure_unicorn",
        "name": { "str": "unicorn figurine" },
        "description": "A figurine of a blue unicorn.  It is in a sitting position, shyly covering both eyes with its front hooves.",
        "weight": 1
      },
      {
        "id": "toy_figure_swampman",
        "name": { "str": "swamp monster figurine" },
        "description": "A figurine of a scaly green swamp monster emerging from some fetid lagoon.",
        "weight": 1
      },
      {
        "id": "toy_figure_reaper",
        "name": { "str": "reaper figurine" },
        "description": "Your heart leaps to your throat as you see the face of Death itself staring back at you, scythe raised for the harvest!  You relax significantly once you realize it's only a few inches tall and made of plastic.",
        "weight": 1
      },
      {
        "id": "toy_figure_mermaid",
        "name": { "str": "mermaid figurine" },
        "description": "A figurine of a redheaded mermaid sitting on a rock.  Like in the film this toy is based on, she gazes longingly out to a world she wants to be a part of - or she would be, but the face isn't drawn very well and doesn't express much emotion at all.",
        "weight": 1
      },
      {
        "id": "toy_figure_avocado",
        "name": { "str": "avocado figurine" },
        "description": "A plastic figurine of an anthropomorphic avocado, holding a salt shaker and a spoon.  Makes a great gift for the guacamole lover in your life, or as a decoration for your kitchen.",
        "weight": 1
      },
      {
        "id": "toy_figure_superhero",
        "name": { "str": "superhero figurine" },
        "description": "A superhero action figure.  Its limbs can be adjusted for different poses, and it is designed to do battle against a wide variety of crooks and supervillains, sold separately.",
        "weight": 1
      },
      {
        "id": "toy_figure_raptor",
        "name": { "str": "raptor figurine" },
        "description": "Standing with clawed feet parted and jaws open in a silent growl, this is the nondescript figurine of some manner of dromaeosaur, with a flare of brightly colored plumage arching from the back of its neck and running along its spine.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_dilophosaur",
        "name": { "str": "Dilophosaur figurine" },
        "description": "With its neck lowered and head curiously cocked, this Dilophosaur figurine stands poised upon a base of faux mud, two semi-circular crests rising from its angular skull.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_pachycephalosaur",
        "name": { "str": "pachycephalosaur figurine" },
        "description": "Standing with a circlet of bony nubs crowning its skull, this dome-headed figurine crouches upon a pair of stocky legs with its lowered, battering-ram-like cranium presented towards the Cataclysm.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_soldier",
        "name": { "str": "soldier action figure", "str_pl": "soldier action figures" },
        "description": "Constructed from soft plastics and clad in a green, beige, and brown uniform, this helmeted action figure of a US Army soldier stands with boots apart, an M4 carbine slung across his back, and a service handgun tucked in a leg holster.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_soldier2",
        "name": { "str": "soldier action figure", "str_pl": "soldier action figures" },
        "description": "With limbs twisted into a kneeling position behind a light machinegun, this is the boonie hat-crowned figurine of a soldier, her body clad in a Marine’s woodland camo uniform and a spare ammo belt worn across her chest.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_soldier3",
        "name": { "str": "soldier action figure", "str_pl": "soldier action figures" },
        "description": "Regarding the world through the eyepieces of a grey gasmask, this soldier figurine stands with their shoulders hunched and body poised in a skulking crouch, their Red Army uniform all but concealed beneath a rubber NBC suit and a Kalashnikov strapped to their chest.",
        "color": "light_gray",
        "weight": 1
      },
      {
        "id": "toy_figure_soldier4",
        "name": { "str": "soldier action figure", "str_pl": "soldier action figures" },
        "description": "Clad in the multi-pattern camouflage uniform of a SAS operative and sporting a floppy, beige beret, this figurine of a British soldier rests prone upon his belly, peeking through the gunsight of a mounted sniper rifle.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_soldier5",
        "name": { "str": "soldier action figure", "str_pl": "soldier action figures" },
        "description": "Outfitted in an old-fashioned black, tan, and olive drabuniform with a green beret perched atop her head, this mud-splattered figurine of a soldier is poised in a running crouch with an M16 assault rifle cradled in her arms and a grenade launcher slung across a shoulder.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_soldier6",
        "name": { "str": "soldier action figure", "str_pl": "soldier action figures" },
        "description": "All but concealed under a parachute smock, with an oxygen mask strapped to their face and a short carbine slung across their chest, this helmeted figurine of a paratrooper stands hunched beneath the bulk of a parachute backpack.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_soldier7",
        "name": { "str": "soldier action figure", "str_pl": "soldier action figures" },
        "description": "This hefty figurine wields a large machinegun in their gauntlet-clad hands, the operator visible through the plastic visor of a set of powered infantry armor that envelops them—a protective shell that forms a barrier between the tiny soldier within and the Cataclysm.  If anyone survived this mess, you’d hope it’d be this toy’s full-sized compatriots.",
        "color": "black",
        "weight": 1
      },
      {
        "id": "toy_figure_police",
        "name": { "str": "police officer action figure", "str_pl": "police officer action figures" },
        "description": "Huddling behind the plastic rectangle of a riot shield, this blue-uniformed police officer peers through a visored helmet, his belt heavy under the weight of a holstered handgun, flashlight, and handcuffs.",
        "color": "blue",
        "weight": 1
      },
      {
        "id": "toy_figure_police2",
        "name": { "str": "police officer action figure", "str_pl": "police officer action figures" },
        "description": "Outfitted in charcoal-black body armor, this figurine of a police officer cradles an MP5 submachinegun, a breaching shotgun clipped to her vest above an array of tier gas grenades, a radio, and a cartridge belt.  You can’t imagine that this toy was particularly popular during the riots.",
        "color": "black",
        "weight": 1
      },
      {
        "id": "toy_figure_detective",
        "name": { "str": "detective action figure", "str_pl": "detective action figures" },
        "description": "Swathed in the embrace of a tan duster and with a wide-brimmed hat pulled low over their eyes, this figurine stands with the grip of a holstered revolver peeking from beneath the lapel of their coat.  Solving 7 billion homicide cases and tracking down the start of the Cataclysm probably sit above this particular detective’s paygrade.",
        "color": "brown",
        "weight": 1
      },
      {
        "id": "toy_figure_zombie",
        "name": { "str": "zombie action figure", "str_pl": "zombie action figures" },
        "description": "Painted a stylized green, this shambling figurine stands with arms outstretched and bloodied jaws parted, their body clad in a tattered lab coat and with one shoe missing.  The toy doesn’t prompt pleasant memories.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_zombie2",
        "name": { "str": "zombie action figure", "str_pl": "zombie action figures" },
        "description": "Laying prone, with one leg reduced to a red-smeared stump and half its gaping jaw blown off in a spray of plastic bone fragments, this figurine rests poised in mid-crawl with a single, grasping hand lifted to the fore.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_zombie3",
        "name": { "str": "zombie action figure", "str_pl": "zombie action figures" },
        "description": "Swollen with distended muscles and coated in stylized wounds, this remarkably beefy figurine of a zombie stands with meaty hands poised and one ear notably gnawed off.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_zombie4",
        "name": { "str": "zombie action figure", "str_pl": "zombie action figures" },
        "description": "This is the plastic figurine of a famous smart zombie from popular media.  The toy has a torn ear, a soft, fuzzy blanket, and a removable jar of bloody pet treats.  It's saluting like a soldier.",
        "color": "green",
        "weight": 1
      },
      {
        "id": "toy_figure_crusader",
        "name": { "str": "crusader action figure", "str_pl": "crusader action figures" },
        "description": "Clad in polished plate armor and hefting a tower shield, this great helm-wearing warrior brandishes an absurdly massive great sword.",
        "color": "light_gray",
        "weight": 1
      },
      {
        "id": "toy_figure_pirate",
        "name": { "str": "pirate action figure", "str_pl": "pirate action figures" },
        "description": "Laden with a bandoleer of flintlock pistols, this old-fashionedly dressed figurine grips a blunderbuss in their gnarled hands, their singular eye leering forth beside its eye-patched mate.",
        "color": "brown",
        "weight": 1
      },
      {
        "id": "toy_figure_pirate2",
        "name": { "str": "pirate action figure", "str_pl": "pirate action figures" },
        "description": "Brandishing a cutlass in one hand and a twin-barrelled pistol in the other, this traditionally clad sea raider stands resplendent with a peg leg, a captain’s hat, and even a multi-colored parrot.",
        "color": "brown",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher",
        "name": { "str": "hockey-mask killer action figure", "str_pl": "hockey-mask killer action figures" },
        "description": "A plastic figurine of a tall, strong individual wielding a bloody machete in his left hand.  He wears a beaten-up hockey mask and ragged clothes that resemble a jacket and jeans.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher2",
        "name": { "str": "chainsaw killer action figure", "str_pl": "chainsaw killer action figures" },
        "description": "A plastic figurine of a somewhat tall, fat individual wielding a bloody chainsaw with both hands.  He wears a dirty apron and a shirt, and apparently, he wears a mask made of hide.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher3",
        "name": { "str": "ghost killer action figure", "str_pl": "ghost killer action figures" },
        "description": "A plastic figurine of an individual wearing a scary white ghost mask with a flowing black robe, wielding a hunting knife in his right hand.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher4",
        "name": { "str": "tallman action figure", "str_pl": "tallman action figures" },
        "description": "A plastic figurine of a tall individual wearing a black suit, white dress shirt, and red tie.  He possesses a distinct pale complexion as well as a unique silver ball in his hand.",
        "weight": 1
      },
      {
        "id": "toy_figure_alien",
        "name": { "str": "alien action figure", "str_pl": "alien action figures" },
        "description": "A vision of pure nightmare, this slavering alien crouches upon fully articulated legs, clawed forelimbs poised as its scorpion-like tail arcs across its back.  Clad in an ebony exoskeleton, its tubular head is cocked to the side, jaws parted, and an inner mandible jutting as it silently challenges the Cataclysm.",
        "weight": 1
      },
      {
        "id": "toy_figure_alien2",
        "name": { "str": "alien action figure", "str_pl": "alien action figures" },
        "description": "A plastic figurine of a very tall, highly detailed creature wearing armor with a shoulder-mounted cannon and a detachable helmet, revealing its ugly face.  It is wielding a futuristic spear and has wrist blades.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher5",
        "name": { "str": "evil cop action figure", "str_pl": "evil cop action figures" },
        "description": "This is a plastic figurine of a strong individual wearing a police officer's uniform, including a leather jacket and a police cap, with a big scar on the right side of his deformed face.  He presents a stern and unyielding expression while wielding a police baton.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher6",
        "name": { "str": "killer doll action figure", "str_pl": "killer doll action figures" },
        "description": "A plastic figurine of a small red-haired doll wearing overalls and a striped shirt.  He wields a kitchen knife.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher7",
        "name": { "str": "killer clown action figure", "str_pl": "killer clown action figures" },
        "description": "A plastic figurine of a scary clown with sharp teeth, wild fluorescent red hair, and a ruffled clown suit, along with a sinister expression on his face.  This figure also comes with a removable red balloon accessory.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher8",
        "name": { "str": "white masked action figure", "str_pl": "white masked action figures" },
        "description": "A plastic figurine of a large individual wearing a white mask and a jumpsuit, wielding a bloody butcher knife.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher9",
        "name": { "str": "hooked killer action figure", "str_pl": "hooked killer action figures" },
        "description": "A plastic figurine of an African-American individual wearing a black, shadowy coat with exposed ribs and a hook for a hand.",
        "weight": 1
      },
      {
        "id": "toy_figure_slasher10",
        "name": { "str": "killer fisherman action figure", "str_pl": "killer fishermen action figures" },
        "description": "A plastic figurine of an individual wearing a trench coat, gloves, and a fishing hat, as well as a removable hook hand.",
        "weight": 1
      }
    ]
  },
  {
    "type": "GENERIC",
    "id": "yoyo",
    "name": { "str": "yoyo" },
    "description": "A simple yoyo on a string.  Now you can be bored with style.",
    "category": "other",
    "material": [ "plastic" ],
    "weight": "50 g",
    "volume": "70 ml",
    "longest_side": "7 cm",
    "price": 200,
    "price_postapoc": 5,
    "symbol": "q",
    "color": "light_gray"
  },
  {
    "type": "GENERIC",
    "id": "fidget_spinner",
    "name": { "str": "fidget spinner" },
    "description": "A fidget spinner.  An artifact from when the times were simpler.",
    "category": "other",
    "material": [ "plastic", "steel" ],
    "weight": "75 g",
    "volume": "185 ml",
    "longest_side": "10 cm",
    "price": 500,
    "price_postapoc": 5,
    "symbol": "/",
    "color": "green"
  },
  {
    "type": "GENERIC",
    "id": "toy_soldier",
    "//": "These are meant to be cheap plastic army men that come by the bucket, rather than the more expensive display or collectible pieces.",
    "name": { "str": "army man", "str_pl": "army men" },
    "description": "A small toy soldier.  This is the generic variant; if you see this, something’s broken.  Better go open an issue about it.",
    "category": "other",
    "material": [ "plastic" ],
    "weight": "2 g",
    "volume": "12 ml",
    "longest_side": "54 mm",
    "price": 27,
    "price_postapoc": 10,
    "symbol": "a",
    "color": "green",
    "variant_type": "generic",
    "variants": [
      {
        "id": "toy_soldier1",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Standing with feet parted, helmeted head tilted downward, and cast in an olive-green uniform, this is a small toy soldier stooping over a shovel held in mid-swing.",
        "weight": 1
      },
      {
        "id": "toy_soldier2",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Feet planted, right hand raised, and uniform cast from green plastic, this is a small toy soldier gripping a lowered, long-barrelled pistol.",
        "weight": 1
      },
      {
        "id": "toy_soldier3",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Poised in mid-jog and dressed in a uniform cast from olive green plastic, this is a small toy soldier tightly clutching a battle rifle, the lowered weapon’s bayonet nearly brushing against the ground.",
        "weight": 1
      },
      {
        "id": "toy_soldier4",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Poised in a defensive stance and gesturing imploringly to the rear, this is a small toy soldier clutching a handgun before him.",
        "weight": 1
      },
      {
        "id": "toy_soldier5",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Kneeling on the ground, helmeted head gazing down a rifle's sights, and clad in a uniform of tan plastic, this is a small toy soldier bracing its weapon across a raised knee.",
        "color": "brown",
        "weight": 1
      },
      {
        "id": "toy_soldier6",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Wading through unseen mire and clad in a uniform of dull brown plastic, this is a small toy soldier bearing an upside-down assault rifle over its helmeted head.",
        "color": "brown",
        "weight": 1
      },
      {
        "id": "toy_soldier7",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Standing rigidly at attention, with arms folded behind its back and a flat-peeked cap crowning its head, this is a small toy soldier clad in a military officer’s uniform cast from tan plastic.",
        "color": "brown",
        "weight": 1
      },
      {
        "id": "toy_soldier8",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Hand raised and tilted to the rear, its body twisted in mid-throw, this is a small toy soldier clinging onto an upright battle rifle as it hurls a hand grenade.",
        "color": "brown",
        "weight": 1
      },
      {
        "id": "toy_soldier9",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Frozen in mid-run and clad in a uniform of gray plastic, this is a small toy soldier hefting a light machinegun, the weapon’s ammunition belt trailing along the soldier's front.",
        "color": "light_gray",
        "weight": 1
      },
      {
        "id": "toy_soldier10",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "With a pair of binoculars raised to its face and a free hand lifted over its beret-clad head, this is a small toy soldier leaning to the fore as it peers towards the horizon.",
        "color": "light_gray",
        "weight": 1
      },
      {
        "id": "toy_soldier11",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Standing with one boot planted aft of its mate and a floppy beret pulled down to its eyes, this is a small toy soldier cradling a submachine gun in its arms.",
        "color": "light_gray",
        "weight": 1
      },
      {
        "id": "toy_soldier12",
        "name": { "str": "army man", "str_pl": "army men" },
        "description": "Laying prone in an army crawl and clad in a uniform of dull gray plastic, this is a small toy soldier with a machine pistol clutched close to its body and a combat knife gripped in its extended hand.",
        "color": "light_gray",
        "weight": 1
      }
    ]
  }
]
